performance-test/simple-test.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 60
      arrivalRate: 1
      name: "Testing basic connection"
  processor: "./simple-processor.js"
  environments:
    load:
      phases:
        - duration: 30
          arrivalRate: 1
          rampTo: 5
          name: "Ramp up load"
        - duration: 60
          arrivalRate: 5
          name: "Sustained load"

scenarios:
  - name: "Minare WebSocket Basic Test"
    flow:
      - log: "Starting WebSocket connection test"
      - function: "connectCommandSocket"
      - think: 2  # Short wait after command socket connection
      - function: "connectUpdateSocket"
      - think: 5  # Wait to receive initial entity sync
      - function: "sendMutationCommand"
      - think: 2  # Wait after mutation
      # Optionally, send more mutations for a more realistic test
      - loop:
          - function: "sendMutationCommand"
          - think: 3
        count: 3