performance-test/simple-test.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 30
      arrivalRate: 1
      name: "Testing basic connection"
  processor: "./simple-processor.js"
  environments:
    load:
      phases:
        - duration: 30
          arrivalRate: 1
          rampTo: 5
          name: "Ramp up load"
        - duration: 60
          arrivalRate: 5
          name: "Sustained load"

scenarios:
  - name: "Minare WebSocket Basic Test"
    flow:
      - log: "Starting WebSocket connection test"
      - function: "connectCommandSocket"
      - think: 5
      - function: "connectUpdateSocket"
      - think: 10  # Increased to give more time for entity sync
      - function: "sendMutationCommand"
      - think: 5